In [1]:
import pandas as pd
from math import sqrt

In [4]:
oyuncular = {"boy":[175,177,178,181,182,183,184,188,190], "deneyim": [4,6,3,2,6,3,7,2,6], "maas":[12,18,15,16,24,20,28,24,32] }

In [5]:
df=pd.DataFrame(oyuncular)

In [6]:
df

   boy  deneyim  maas
0  175        4    12
1  177        6    18
2  178        3    15
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28
7  188        2    24
8  190        6    32

In [7]:
df.maas.mean()

21.0

In [8]:
df.maas-df.maas.mean()

0    -9.0
1    -3.0
2    -6.0
3    -5.0
4     3.0
5    -1.0
6     7.0
7     3.0
8    11.0
Name: maas, dtype: float64

In [9]:
(df.maas-df.maas.mean()).pow(2).sum()

340.0

In [10]:
# ilk bölme
filt =(df.boy<=180)

In [14]:
df1=df[filt]
df2=df[~filt]

In [15]:
df1

   boy  deneyim  maas
0  175        4    12
1  177        6    18
2  178        3    15

In [16]:
df2

   boy  deneyim  maas
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28
7  188        2    24
8  190        6    32

In [17]:
df1.maas.mean()

15.0

In [18]:
df2.maas.mean()

24.0

In [19]:
# ilk bölme error
(df1.maas-df1.maas.mean()).pow(2).sum() + (df2.maas-df2.maas.mean()).pow(2).sum()

178.0